// Constants, Final
// این دو مبحث زمانی بدردمون میخوره که یک متغییری
// داشته باشیم که مقدار اون ثابت باشه
// و هیچ وقت نیاز به تغییر نداشته باشه
// یعنی اینکه مقدار متغییر دیگه ثابت هستش

// Final
// فاینال به اینصورت هست که ما هم میتونیم وقتی متغییر رو بهش میدیم
//  مقدار اون رو هم مشخص کنیم و حتی بعد اینکه اون رو ساختیم بهش مقدار بدیم
//  ولی بعد از مقدار دهی دیگه نمیتونیم اون مقدار رو تغییر بدیم

// روش اول
// وقتی از فاینال استفاد میکنیم دیگه اجازه تغییر مقدار رو بهمون نمیده
// void main(List<String> args) {
//   final String name = 'omid';
//   name = 'ali';
//   print(name);
// }

// output:
//  Error: Can't assign to the final variable 'name'.
//   name = 'ali';
// ---------------------------------------------------------------------------------------------------------
// روش دوم
// اول متغییر رو میسازیم بعد بهش مقدار میدیم
//  ولی بعد از اینکه مقدار دادیم دیگه نمیتونیم مقدار رو تغییر بدیم

// void main(List<String> args) {
//   final String name;
//   name = 'javad';
//   name = 'gholam';
//   print(name);
// }

// output:
// Error: Final variable 'name' might already be assigned at this point.
//   name = 'gholam';
// ------------------------------------------------------------------------------------------------------------

// Constants
// کانتس هم ثابت هستش ولی قبل از اینکه کد اجراع بشه باید مشخص بشه چه
// چیزی داخل اون متغییر قراره ذخیره بشه

// void main(List<String> args) {
//   const String birthday = '1373/10/22';
//   print(birthday);
// }

// output:
// 1373/10/22
//-----------------------------------------------------------------------------------------------------------------
// late
// لیت برای اینه که به برنامه بگیم برو بعدا من مقدار رو بهت میدم

// مثال
// void main(List<String> args) {
  
// }

// class a {
//   late final String name;
// }
// ==============================================================================================================================