// روش اول تعریف نامبرها

// روش اول
// اینجا نوع متقییر و مقدارشون رو تعریف مینیم
// void main(List<String> args) {
//   int numbers1 = 73;
//   double number2 = 17.5;
// }

// روش دوم
// اینجا اول متقییر هارو تعریف میکنیم
// بعدن زیرش مقدارشون رو معین میکنیم
// void main(List<String> args) {
//   int number1;
//   double number2;
//   number1 = 44;
//   number2 = 18.5;

// }

// روش سوم
//  اینجا هر چند تعداد متقییر که بخایم رو در یک خط تعریف میکنیم
//  و بعد در زیرش مقدارهاشون رو معین میکنیم
// void main(List<String> args) {
//   int number1, number2, number3;
//   number1 = 1;
//   number2 = 2;
//   number3 = 3;

// }

//-------------------------------------------------------------------
// null sefti

// اینجا اگر جلوی نوع متغییر علامت سوال بزاریم
// یعنی به برنامه گفتیم این متقییر اجازه داره که هیچی یا خالی باشه
// void main(List<String> args) {
//   int? numbers;
//   print(numbers);
// }
// output ... null

// اینجا اگر جلوی پرینت علامت تعجب بزاریم
// یعنی به برنامه گفتیم اجرازه نده متقییر نال باشه
//  واگه نال بود جلوش رو بگیر و
// چون جلوی نوع متقییر نامبر علامت سوال گزاشتیم
// که منظورمون این بوده که این متقییر اجازه داره نال باشه
//  بهمون ارور میده و میگه که متقییر نامبر نال هستش
//  و چون جلوی من علامت تعجب گزاشتی من نمیتونم اجازه بدم اجراع بشه
// و باید از نال بودن درش بیاری

// void main(List<String> args) {
//   int? numbers;
//   print(numbers!);
// }

// // output ... Unhandled exception:
// Null check operator used on a null value

//-------------------------------------------------------------------
//  اینجا اگر ندونیم عددی که قراره داخل متغییر ذخیره بشه صحیح است
// یا اعشاری از نام استفاده میکنیم

// void main(List<String> args) {
//   num numbers = 41.4;
//   print(numbers);
//   // با این دستور هم میتونیم نوع داده رو ببینیم
//   print(numbers.runtimeType);
// }
// //output ...
// // 41.4
// // double
// ========================================================================

// متدها در نامبر
//  number metod

// 1
// متد تبدیل عدد استرینگی به عدد صحیح
// اینجا داخل متغییر ای یک استرینگ بود
//  که با متد پارس اون رو تبدیل کردیم به عدد صحیح

// void main(List<String> args) {
//   var a = "99";
//   var b = num.parse(a);
//   print(a.runtimeType);
//   print(b.runtimeType);
// }

// // خروجی
// // String
// // int
// ------------------------------------------------------------------
// 2
// //متد قطر مطلق یا مثبت کردن عدد منفی ی

// void main(List<String> args) {
//   int num1 = -12;
//   int num2 = num1.abs();
//   print(num2);
// }

// // خروجی
// //  12
// ------------------------------------------------------------------
// 3
//  متد سیل برای به سقف رسوندن یک عدد

// void main(List<String> args) {
//   num a = 2.1;
//   print(a.ceil());
// }
// // خروجی
// // 3

// ------------------------------------------------------------------
// 4
// متد مقایسه اعداد
// اگر عدد وارد شده از عدد داخل متغییر بزرگتر باشد
// یک را برمیگرداند اگر کوچیکتر باشد منفی یک ر رو برمیگرداند
//  و اگر مساوی باشد صفر را برمیگرداند

// void main(List<String> args) {
//   num num1 = 12;
//   print(num1.compareTo(13));
// }
// خروجی
//  -1
// ------------------------------------------------------------------
// 5
//  متد به کف رسوندن یک عدد

// void main(List<String> args) {
//   num num1 = 12.9;
//   print(num1.floor());
// }
// خروجی
// 12
// ------------------------------------------------------------------
// 6
//  متد های تبدیل نوع اعداد به هم دیگر

// متد تبدیل عدد صحیح به اعشاری
// void main(List<String> args) {
//   num num1 = 12;
//   var num2 = num1.toDouble();
//   print(num2);
// }
// خروجی
//  12.0

// متد تبدیل عدد اعشاری به عدد صحیح

// void main(List<String> args) {
//   num num3 = 12.50;
//   var num4 = num3.toInt();
//   print(num4);
// }

// خروجی
// 12

// متد تبدیل عدد به استرینگ
// void main(List<String> args) {
//   num num1 = 12;
//   var num2 = num1.toString();
//   print(num2.runtimeType);
// }
// خروجی
// String  عدد دوازده که عدد صحیح بود تبدیل شد به استرینگ
// ==================================================================
// property

// 
// isNegative  چک میکنه عدد مفی هست یانه
// این پروپرتی چک میکنه کدوم عدد مثبت هستش
// و کدوم منفی هستش و با ترو و فالس مشخص میکنه

// void main(List<String> args) {
//   int number1 = 10;
//   int number2 = -20;
//   print(number1.isNegative);
//   print(number2.isNegative);
// }

// output:
// false
// true
// ------------------------------------------------------------------

// sign
// این پراپرتی چک میکنه کدوم عدد بزرگتر و کوچیکتره
// اگر عدد بزرگتر از 0 باشه یک رو برمیگردونه
//  اگه عدد 0 باشه 0 رو برمیگردونه
// اگه عدد کوچیکتر از 0 باشه 1- رو برمیگردونه

// void main(List<String> args) {
//   int num1 = 10;
//   int num2 = -20;
//   int num3 = 0;
//   print(num1.sign);
//   print(num2.sign);
//   print(num3.sign);
// }

// output:
// 1
// -1
// 0
// ------------------------------------------------------------------

// isEven
// این پراپرتی چک میکنه عدد زوج هست یا نه

// void main(List<String> args) {
//   int num1 = 10;
//   int num2 = 11;
//   print(num1.isEven);
//   print(num2.isEven);
// }

// output:
// true
// false
// ------------------------------------------------------------------

// isOdd
// این پراپرتی چک میکنه عدد فرد هست یانه

// void main(List<String> args) {
//   int num1 = 10;
//   int num2 = 11;
//   print(num1.isOdd);
//   print(num2.isOdd);
// }

// // output:
// false
// true
// ============================================================================================================
