// اوپراتور های ریاضی

// void main(List<String> args) {
//   var num1 = 10;
//   var num2 = 20;
// //  اوپراتور جمع
//   print(num1 + num2);
// //   اوپراتور منحی
//   print(num1 - num2);
// //   اوپراتور ضرب
//   print(num1 * num2);
// //   اوپراتور تقسیم
//   print(num1 / num2);
// //   اوپراتور تقسیم که عدد صحیح رو بر میگردونه
//   print(num1 ~/ num2);
// //   اوپراتور تقسیم که باقیمانده رو بر میگردونه
//   print(num1 % num2);

// //این اوپراتور پلاس پلاس هستش که به  مقدار متغییر یک عدد اضافه میکنه
//   num1++;
//   print(num1);

// //این اوپراتور ماینس ماینس هستش که از مقدار متغییر یک عدد کم میکنه
//   num2--;
//   print(num2);
// }

// // output:
// 30
// -10
// 200
// 0.5
// 0
// 10
// 11
// 19
// ============================================================================================
// اوپراتور های مقایسه ای

// void main(List<String> args) {
//   var num1 = 5;
//   var num2 = 9;

// //  میگه ایا نام یک بزرگتر است از نام دو
//   print(num1 > num2);
// // میگه ایا نام یک کوچیکتر است از نام یک
//   print(num1 < num2);
// //  میگه ایا نام یک بزرگتر یا مساوی است با نام دو
//   print(num1 >= num2);
// //   میگه ایا نام یک کوچیکتر یا مساوی است با نام دو
//   print(num1 <= num2);
// //   میگه ایا نام یک مساوی نیست با نام دو
//   print(num1 != num2);
// //   میگه ایا نام یک مساوی است با نام دو
//   print(num1 == num2);
// }

// // output:
// false
// true
// false
// true
// true
// false
// ===============================================================================================
// اوپراتور تست تایپ

// این اوپراتور داره میگه که ایا متقییر نام اینت است که جوابش میشه ترو

// void main(List<String> args) {
//   int num = 2;
//   print(num is int);
// }
// output:    true

// این اوپراتور داره میگه که ایا متقییر نام اینت نیست
// که باز هم جوابش میشه ترو چون متغییر اینت نیست

// void main(List<String> args) {
//   double num = 12.3;
//   print(num is! int);
// }
// // output:    true
// =============================================================================
// اوپراتور انتصاب

// این اوپراتور ها هر عملیاتی که قبل از مساوی بزاریم رو روی مقدار متغییر ثبت میکنه

// void main(List<String> args) {
//   num number = 12;
//   print(number += 2);
//   print(number -= 2);
//   print(number *= 2);
// }
// // output:
// 14
// 12
// 24
// =======================================================================
//  اوپراتورهای منطقی
//  and = &&

//   وقتی از علامت && استفاده میکنیم باید همه ی شرط ها درست باشد
//  وگرنه فالس بر میگرداند
// void main(List<String> args) {
//   int a = 10;
//   int b = 12;

//   print((a < b) && (b > a));
// }

// output
// true
// --------------------------------------------------------
// اوپراتورهای منطقی
// or = ||

//  وقتی از علامت ||استفاده میکنیم حتی اگر یکی از شرط ها
// هم درست باشد تروو بر میگرداند

// void main(List<String> args) {
//   int a = 10;
//   int b = 12;

//   print((a > b) || (b > a));
// }

// output:
// true
// ----------------------------------------------------------------
//  اوپراتورهای منطقی
//  not = !

//  وقتی از علامت ! استفاده میشود هر جوابی رو برعکس میکنه
// در مثال زیر جواب اصلی فالس میشه که با علامت نات که گزاشتیم
//  جواب شد تروو

// void main(List<String> args) {
//   int a = 10;
//   int b = 12;
//   var result = !(a == b);
//   print(result);
// }
// output:
// true
// ======================================================================================
// عبارات شرطی کمیاب
// مثال اول

// در اینجا وقتی یک شرط نوشتیم یعد از علامت سوال
// اگر شرط درست بود اولی رو چاپ میکنه
//  اما اگر غلط بود خط بعد از دو نقطه رو چاپ میکنه

// void main(List<String> args) {
//   int a = 15;
//   var res = a > 12 ? 'a bozogtar az 12 ast!!' : 'a bozogtar az 12 nist!!';
//   print(res);
// }
// output:
// a bozogtar az 12 ast!!
// ------------------------------------------------------------
// عبارات شرطی کمیاب
//  مثال دوم
// در این جا وقتی دو علامت سوال استفاده میکنیم
//  اگر هر کدام از متغییر ها که نال نبود ان رو نمایش میده


// void main(List<String> args) {
//   var a = 122;
//   var b = null;
//   var result = a ?? b;
//   print(result);
// }
// output:
// 122
// =============================================================================================